[
  "Allium: Also known as flowering onion, this plant grows from a bulb or from seed, and produces globes of purple clusters of flowers atop long stems. Plant in full sun, in moist but well-drained soil.",
  "Anemone: Also known as windflower, these tuberous flowers produce poppy-like blooms in early-to-mid spring. Plant anemones in full sun or part shade.",
  "Artemisia: This perennial plant is grown more for its silvery, white foliage than for the small, white flowers, but makes an excellent backdrop for more showy flowers in a perennial bed. Give Artemisia (hardy to zone 4) dry, moderately fertile soil.",
  "Alyssum: Classified as a perennial, this plant is grown as an annual in cold climates. Its tiny clusters of blooms are attractive at the edge of a bed or in pots with geraniums or other annuals.",
  "Aster: Asters bloom in late summer to early fall, when many other perennials have faded. They range from varieties that skim the ground, to those towering 6 feet high. The daisy-like flowers come in many colors; the most common shades are purple, lavender, pink, red, blue and white. Plant asters in moist, well-drained soil in a sunny area.",
  "Astilbe: For color in a shade garden, few perennials can beat astilbe. The plants produce feathery, plumelike flowers and fernlike leaves. Astilbes prefer acidic, moist soil and partial shade.",
  "Bachelor Button: Sometimes called cornflower, this plant is more frost-hardy than most annuals, and produce small, multi-petaled flowers. Sow seeds in the garden in early spring in a sunny location.",
  "Balloon Flower: Balloon flowers bring to mind cottage gardens, with their old-fashioned bell-shaped flowers. Plant these perennials in sun or partial shade. They prefer slightly acidic, moist soil.",
  "Bee Balm: Plant bee balm in a perennial bed, but keep an eye on it. This plant can become invasive. The large, bright flowers attract butterflies and hummingbirds. Grow bee balm in sun or partial shade and a rich soil.",
  "Bellflower: This old fashioned perennial has lovely bell-shaped flowers; most varieties are blue, lavender, pink or white. Plant bellflower in sun and provide moist, rich soil.",
  "Blanketflower: Gaillardias, or blanketflowers, thrive in hot, dry locations and produce daisy-like flowers in a variety of hues, such as red, yellow and gold. Many are multi-colored. Plant them in sandy, well-drained soil and don’t overwater them.",
  "Bleeding Heart: This native plant produces spectacular white, pink or red heart-shaped blooms on long, arching stems. Plant bleeding hearts in slightly acidic, moist soil in partial shade.",
  "Bougainvillea: This thorny shrub or vine-like plant grows throughout the Southwestern and Southeastern United States. Its flowers are papery and come in a variety of shades, such as fuschia, pink, white or salmon. It loves heat, full sun and dry conditions. Grow it as an annual in the north.",
  "Broom: Broom is a fast-growing shrub with an open, arching habit. It is covered with yellow flowers in spring. Plant broom in full sun. It tolerates poor, sandy soil and drought conditions.",
  "Butterfly Weed: Butterfly weed is related to milkweed and attracts not only butterflies, but caterpillars. It produces bright flower clusters in early-to-mid summer. Plant butterfly weed in full sun in light, well-drained soil.",
  "Butterfly Bush: Not to be confused with butterfly weed, this flowering shrub can grow 8 feet high, producing long spikes of colorful blooms. The plant is drought tolerant and prefers full sun. In warm locations, it can become invasive.",
  "Camellia: Camellias are only hardy south of zone 8. If you’re lucky enough to live in a temperate region, though, make a place for them in your yard. The fragrant flowers, which range from red to pink to white are 2 to 5 inches wide and bloom in the winter.",
  "Catmint: This fast-growing perennial produces lavender blooms and soft, green-gray foliage. It grows in full sun or partial shade and is very drought tolerant. And yes, cats adore it.",
  "Chrysanthemum: Mums are generally grown as annuals in cold climates. These plants may produce dime-size pompoms to huge, daisy-like blooms.",
  "Clematis: This flowering vine produces extravagant flowers in mid-summer or late fall, depending on the variety. Plant clematis in full sun, but keep its roots cool with mulch or other plants.",
  "Columbine: Columbines grow wild in woodlands throughout the United States, but their lovely, fragile blooms complement perennial beds, as well. Grow columbines in partial shade to full sun.",
  "Coneflower: Daisy-like blooms and easy care make coneflower a good choice for any perennial bed. Black-eyed Susan is a popular variety and may stand 6 inches high to 4 feet high. Purple coneflower produces large purple flowers with iridescent centers. Coneflower prefers full sun and tolerates drought.",
  "Coral Bells: Delicate red or pink bells dangle above wiry stems. Coral bells are hardy to zone 3 and grow well in a shade garden. They prefer moist, fertile soil with good drainage.",
  "Coreopsis: These cheery yellow or orange flowers resemble daisies and grow in almost any conditions. They are short-lived, but self-sow. Deadhead the flowers to keep the plant looking tidy.",
  "Cosmos: Cosmos grow easily, producing light airy flowers most of the summer. They grow as much as 4 feet high and may require staking. Plant them in full sun or part shade. They prefer slightly dry, infertile soil.",
  "Crocus: This spring-blooming bulb pokes its head up long before other plants appear. The flowers come in a variety of colors and resemble small, delicate tulips. Plant crocus in sun or shade. If you have the room, plant them in several locations to extend bloom time.",
  "Cyclamen: Most people think of the exotic florists’ cyclamen that produce large, magnolia-like blooms, but alas, they are only hardy to zone 9. If you live in a northern climate, try hardy cyclamen, hardy to zone 5. The flowers are slightly smaller, but just as beautiful. Plant cyclamen corms in mid-summer.",
  "Dahlia: Once you’ve mastered spring-blooming bulbs, try your hand at summer-blooming bulbs, such as dahlias. These flowers are planted in the spring after the last frost for a summer display of large, multi-petaled blooms. Dig them up and store them after the first few frosts.",
  "Day Lily: Day lilies are often found growing along ditches and in fields, a testament to their low-maintenance style. Plant day lilies in full sun or partial shade. Divide them every two to three years.",
  "Delphinium: These majestic plants are a bit finicky, but earn their keep in beautiful spikes of blooms. They prefer cool summers, rich alkaline soil and moist conditions. Stake tall delphiniums to keep them from toppling.",
  "Foxglove: This old-fashioned plant is a bit hard to grow and may not reliably come back in cold climates. Plant it in partial shade. Foxglove prefers well-drained, moist, fertile soil. Foxglove is toxic.",
  "Gas Plant: The gas plant grows slowly, but rewards the patient gardener with pink or white flower spikes in early spring. This plant prefers full sun to partial shade. The plants produce a gas on humid summer nights. Lore says the gas can be ignited by a match.",
  "Gayfeather: These native American wildflowers produce tall stalks of delicate flowers. Plant them in full sun. Hardy to zone 4.",
  "Geranium: Common geraniums are most often grown as annuals north of zone 7, although they overwinter well in a sunny, indoor location. The flowers come in a variety of colors and the plants have a peppery smell. Grow them in full sun.",
  "Gladiolus: Like dahlias, gladiolus are summer-blooming corms. They produce spikes of colorful blooms. Grow them in a sunny location and dig them up when the first fall frost arrives.",
  "Globeflower: These perennial flowers grow best in partial shade, producing large round flowers in shades of yellow or orange.",
  "Grape Hyacinth: These bulbs bloom in spring, producing clusters of tiny blue or purple flowers that resemble grapes. Plant them in late summer in full sun or part shade.",
  "Hardy Geranium: These perennial plants are not related to annual geraniums. They produce five-petaled blooms from late spring well into summer and prefer partial shade.",
  "Hollyhock: Hollyhocks were the mainstay of the cottage garden for many years. These biennial plants produce papery flowers in a variety of colors on stalks that may grow 7 feet high. Plant them in full sun in moist, rich soil.",
  "Honeysuckle: This old-fashioned vine produces white and gold blooms and may be quite invasive. Plant it in sun or shade and prune them back to control them.",
  "Hosta: Hostas produce white, lavender or pink blooms, but are grown more for their lush green or variegated foliage. Plant hostas in partial to full shade.",
  "Hyacinth: Hyacinths are spring-blooming bulbs that produce spikes of flowers suitable for cuttings. Their sweet scent is also welcome in an indoor arrangement. Plant hyacinth bulbs in early fall.",
  "Hybrid Tea Roses: Hybrid tea roses are among the most common flowers for wedding bouquets. While they take a bit of pampering to grow, the sturdy blooms make lovely, long-lasting flower arrangements. Plant tea roses in full sun, in moist, well-drained soil.",
  "Hydrangea: Think hydrangeas are just for Southern gardeners? Think again. While mophead hydrangeas are hardy only to zone 6, several other varieties, such as ‘Annabelle’ thrive in cold regions. Give hydrangeas moist, slightly acidic soil. Learn more.",
  "Impatien: Choose impatiens when you want a quick burst of color in a shady spot. Impatiens are tender annuals, and usually come in pink, red, white, purple or salmon. Plant them after the last frost. Learn more.",
  "Iris: Iris grow from tubers and bloom in early-to-mid spring before most perennials appear. They spread rapidly, requiring division every three to four years.",
  "Jupiter’s Beard: This fast-growing perennial produces bright masses of pink or red flowers mid-to-late summer. The plant prefers full sun, but isn’t picky about soil.",
  "Kerria: This flowering shrub grows 5 to 7 feet high and produces colorful yellow flowers in late spring. The plant prefers partial shade and well-drained soil.",
  "Lamium: Lamium produces lovely spikes of pink, purple or white blooms, but it is more often grown for its variegated leaves. Lamium is a fast-growing ground cover that thrives in shady conditions.",
  "Lantana: These plants produce lovely clusters of tiny flowers on long, trailing vines. A perennial, grown as an annual in northern climates, lantana work well planted en masse, in hanging containers.",
  "Larkspur: Larkspur are an easy-care alternative to fussy delphiniums, producing tall stalks of airy flowers. Plant these annuals in early spring as soon as the soil is soft. They thrive in full sun, or part shade. Mulch larkspur to keep the roots cool. Learn more.",
  "Lavender: Lavender is lovely growing in masses in the perennial bed, but is equally fine in dried arrangements, wreaths or as fragrant sachets. Spanish or French varieties are generally hardy only to zone 6. Choose English lavender in cold regions.",
  "Lilac: Lilac’s unique fragrance and lovely clusters of blooms last for several days in cut arrangements. Lilac prefers full sun, but tolerates drought and poor soils.",
  "Lily-of-the-Valley: The fragrant, white bell-like flowers of this plant are often included in wedding bouquets, but it is also used as a ground cover. Plant it in part to full shade.",
  "Lobelia: The tiny clustered flowers of lobelia look lovely in hanging baskets. Lobelia are most commonly blue although they may also be white. Give these annual plants moist, rich soil and partial sun in hot climates.",
  "Loosestrife: Loosestrife produces tall spikes of pink or purple flowers, making them a good choice for the back of the garden. They provide vertical interest, but are easier to grow than floxgove or delphinium. They do not require staking. Plant loosestrife in full or partial shade.",
  "Lupine: Tall spikes of flower clusters look spectacular at the back of a perennial bed. Most varieties prefer cool, moist conditions. Plant them in sun or light shade.",
  "Marigold: Marigolds have a distinct, peppery smell that some people find displeasing. The good news is that insect pests may also avoid the scent. Sow marigold seeds in flower beds and around the vegetable garden in late spring, after the last frost.",
  "Mock Orange: Mock orange shrubs bear clusters of fragrant white flowers in mid-spring to early summer. The shrub grows 3 to 6 feet high and tolerates almost any soil type. Plant in sun or part shade.",
  "Morning Glory: This annual vine grows quickly, providing instant color on fences, arbors or mailboxes. The plant is slow to germinate – try soaking the seeds or nicking them with a file –but produces lovely, round blooms all summer. It self-sows and may become invasive.",
  "Moon Flower: This relative of the morning glory vine produces fragrant, night-blooming flowers. Like morning glory, it is an annual north of zone 8.",
  "Narcissus: Whether you call them narcissus, daffodils or jonquils, these spring blooming bulbs provide bright cheer under deciduous trees, in flower beds or naturalized in a lawn. Daffodils are most commonly white, yellow, orange or multi-colored. Deer consider tulips a rare delicacy, but avoid daffodils.",
  "Nasturtium: These tender annuals produce ruffled flowers in a variety of bright colors and round, variegated foliage. Both the flowers and leaves are edible. Plant nasturtiums after the last frost in full sun and dry, sandy soil.",
  "Nicotiana: Also known as flowering tobacco, nicotiana has trumpet-shaped flowers that smell sweet at night. Plant nicotiana in full sun, in well-drained, slightly alkaline soil.",
  "New Guinea impatien: New Guinea impatiens have glossy, variegated foliage and larger blooms than regular impatiens. Grow them in partial shade, in moist, cool conditions.",
  "Oleander: Oleander is an evergreen shrub, hardy only to zone 8 or 9. It produces lovely, fragrant white or pink flowers. The plant is highly toxic.",
  "Pansy: Technically a perennial, pansies are treated as frost-hardy annuals in cold climates. Plant them in early spring for some bright color. They are suitable for annual beds, containers and pots. Pansies don’t tolerate heat.",
  "Passion Flower: These robust, tropical vines produce large, showy flowers and even fruit. The maypop is hardy to zone 6 or 7; other varieties grow in warm climates only. Grow passion flower vines in full sun and light, moist soil.",
  "Peony: Old-fashioned peonies thrive in cold climates and don’t tolerate warm winters, although some new varieties are warm-region adapted. They take several years to become established and may require staking, but their beautiful, lush blooms are worth the wait. Peonies are a popular, if fragile, choice for wedding bouquets.",
  "Petunias: Petunias are frost-tender annuals related to the potato. They come in many colors and bloom profusely from early summer. Plant petunias in beds or containers in full sun. Water them regularly during hot weather. Petunias grow slowly from seed; most gardeners prefer to use nursery transplants.",
  "Pinks: Dianthus, commonly known as ‘pinks,’ resemble carnations and come in a variety of colors and sizes. Pinks prefer full sun and thrive in slightly alkaline, well-drained soil.",
  "Poppy: Oriental poppies produce showy flowers in late spring or summer. Plant them in late summer or fall, in full sun, except in hot climates, where they benefit from partial shade.",
  "Primrose: Primrose come in a rainbow of hues and may stand 3 inches high to over 2 feet high, depending on the variety. All primroses prefer partial shade, moist soil and cool conditions. They don’t tolerate hot climates.",
  "Rhododendron: Rhododendron and azaleas are lovely shrubs, with glossy evergreen leaves and brilliant clusters of blossoms. Unfortunately, they are somewhat picky about growing conditions. They require moist, acidic soil and wind protection.",
  "Rose of Sharon: This shrub produces papery, exotic looking flowers in late summer. The shrub has a somewhat columnar growth and is good for hedges. It grows in full sun or part shade and tolerates most soil types.",
  "Salvia: Salvia spreads quickly, forming clumplike masses with stalks of blue, red or lavender flowers. While it is treated as an annual, the plant self-sows prolifically, so you may have volunteers throughout the garden.",
  "Scabiosa: Sometimes called pin cushions, these plants produce lacy blue or white flowers atop 6 inch stems. Plant a mass of them for the best effect. Scabiosa prefers full sun and moist, slightly alkaline soil.",
  "Scilla: These cold-hardy bulbs produce delicate bell-shaped flowers in early spring. The blooms are most often lavender, pink or white. Plant scilla in late fall in sun or part shade.",
  "Sedum: Sedum produce succulent leaves and thick, padded flowers, often in the fall, depending on the variety. Plant them in full-sun, in a rock garden or other infertile place.",
  "Shasta Daisy: Shasta daisies produce white flowers suitable for cut arrangements, blooming through most of the summer. Plant them in full sun, except in hot climates where they benefit from some shade.",
  "Shrub Roses: Shrub roses are old-fashioned cousins of hybrid tea roses. Their blooms are usually less complex, but more fragrant than tea roses. Plant shrub roses in full sun. They require less maintenance than tea roses, but benefit from yearly pruning.",
  "Silver Lace Vine: Silver lace vine produces clusters of pink or white blooms in late summer, when most other vines and perennials are slowing down. It tolerates poor soil and drought conditions.",
  "Snap Dragon: Snap dragons are perennials grown as half-hardy annuals. They produce stalks of flowers in a variety of hues and bloom long after most annuals are killed off by frost. Sow seeds in late spring in full sun.",
  "Snowball bush: This viburnum grows 8 to 12 feet high and produces large, round clusters of white flowers in mid-to-late spring. Snowball bush isn’t picky about soil types and tolerates drought.",
  "Snowdrops: Plant these bulbs in late summer for an early spring display. Snowdrops are usually the first flowers to appear, brightening a dreary landscape with their white, drooping flowers.",
  "Sweet Pea: Sweet peas are related to garden peas and produce fragrant white, pink or blue flowers on climbing vines. Plant them in early spring since they prefer cool temperatures.",
  "Trumpet Vine: This robust, climbing vine produces fragrant trumpet-shaped flowers that attract butterflies and hummingbirds. Plant it in full sun in slightly dry conditions. Learn more.",
  "Tulip: A large display of spring-blooming tulips makes a stunning and welcome statement when most other plants are dormant. Tulips come in a wide variety of colors and sizes. Plant them in fall, choosing heavy, well-formed bulbs that show no signs of rot. Learn more.",
  "Vinca: Also known as periwinkle, vinca is a ground cover that produces glossy, dark green leaves and blue or white flowers in early spring. Grow vinca anywhere you need a fast-growing ground cover. The plant tolerates dry, poor soils and shade.",
  "Wisteria: Wisteria is not for the faint-hearted. These exotic, long-lived vines require a strong support (never a tree) and may become invasive in warm climates. Their violet, white or pink clusters of blooms bloom unpredictably and are easily killed by cold.",
  "Yarrow: Yarrow produce clusters of yellow, white, salmon, pink or red flowers atop long stems. Their airy, grayish green foliage is attractive, as well. Yarrow spread quickly and tolerate drought and poor soils."
]
